app/controllers/api/v1/trips_controller.rb

    def index
      # get the user from params
      user = User.find(params[:user_id])
      # check if the current user is an admin
      if current_user.admin == true
        @trips = user.trip.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 358], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = $1  [["user_id", 358]]

      def set_trip
        @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 106], ["LIMIT", 1]]