app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
        def index

          @user = current_user
          authorize! :read, @user

          @users = User.all